In [1]:
import numpy as np

In [2]:
# Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. 
# Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. 
# Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по 
# каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [3]:
a = np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]]).transpose()

In [4]:
a

array([[ 1,  6],
       [ 2,  8],
       [ 3, 11],
       [ 3, 10],
       [ 1,  7]])

In [6]:
for i in a:
    mean_a = np.array([a[:, 0].mean(), a[:,1].mean()])

In [7]:
mean_a

array([2. , 8.4])

In [8]:
# Задание 2
# Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков, 
# содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

In [9]:
a_centered = np.zeros((5,2))
# print(a_centered)
j = 0
for i in a:
    a_centered[j] = [i[0] - mean_a[0], i[1] - mean_a[1]]
    j=j+1

In [10]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [11]:
a_centered = np.array([a[:,0] - mean_a[0], a[:,1] - mean_a[1]]).transpose()

In [12]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [13]:
# Задание 3
# Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться величина a_centered_sp. 
# Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [14]:
a_centered_sp = np.dot(a_centered[:,0], a_centered[:,1])/(len(a_centered)-1)

In [15]:
a_centered_sp

2.0

In [ ]:
# Задание 4**
# Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся в массиве “а”. 
# В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на N, поэтому полученная нами 
# величина является несмещенной оценкой ковариации.
# Подробнее узнать о ковариации можно здесь:
# https://studopedia.ru/9_153900_viborochnaya-kovariatsiya-i-viborochnaya-dispersiya.html
# В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с помощью функции np.cov. 
# В качестве аргумента m функция np.cov должна принимать транспонированный массив “a”.
# В получившейся ковариационной матрице (массив Numpy размером 2x2) 
# искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.

In [178]:
np.cov?

In [176]:
a_centered_sp_2 = np.cov(m = a.transpose())

In [177]:
a_centered_sp_2

array([[1. , 2. ],
       [2. , 4.3]])

In [16]:
# Задание 1
# Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, 
# в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
# Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
# [1, 1, 1, 2, 2, 3, 3], 
# ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
# [450, 300, 350, 500, 450, 370, 290].

In [61]:
import pandas as pd

In [62]:
authors = pd.DataFrame( {'author_id': [1,2,3], 'author_name': ['Тургенев', 'Чехов', 'Островский']} )
# authors.colums = ['author_id', 'author_name']

In [63]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [64]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                                  'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    'price':[450, 300, 350, 500, 450, 370, 290] })

In [65]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [66]:
# Задание 2
# Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [67]:
authors_price = pd.merge(authors, book,  on='author_id', how='outer')

In [68]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [69]:
# Задание 3
# Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [70]:
top_5 = authors_price.sort_values(by = 'price', ascending=False).head(5)

In [71]:
top_5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [72]:
# Задание 4
# Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
# author_name, min_price, max_price и mean_price,
# в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

In [140]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [144]:
authors_stat = pd.DataFrame(columns = ['author_name', 'min_price', 'max_price', 'mean_price'])

In [145]:
authors_stat['author_name'] = authors_price['author_name'].unique()

In [146]:
authors_stat

  author_name min_price max_price mean_price
0    Тургенев       NaN       NaN        NaN
1       Чехов       NaN       NaN        NaN
2  Островский       NaN       NaN        NaN

In [157]:
for i in authors_price['author_name'].unique():
    authors_stat.loc[authors_stat['author_name'] == i, 'max_price'] = authors_price.loc[authors_price['author_name'] == i, 'price'].max()
    authors_stat.loc[authors_stat['author_name'] == i, 'min_price'] = authors_price.loc[authors_price['author_name'] == i, 'price'].min()
    authors_stat.loc[authors_stat['author_name'] == i, 'mean_price'] = round(authors_price.loc[authors_price['author_name'] == i, 'price'].mean(),1)

In [158]:
authors_stat

  author_name min_price max_price mean_price
0    Тургенев       300       450      366.7
1       Чехов       450       500        475
2  Островский       290       370        330

In [ ]:
# Задание 5**
# Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, 
# какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
# ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
# Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.
# Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. 
# Используйте для этого функцию pd.pivot_table. 
# При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. 
# Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
# Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". 
# Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и 
# book_info2 идентичны.

In [159]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [160]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [161]:
pd.pivot_table?

In [168]:
book_info = authors_price.pivot_table(values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum).fillna(0)


# a = df.pivot_table(index = ['A','B'], values = 'D',columns = 'C', aggfunc = 'sum')

In [170]:
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [172]:
book_info.to_pickle('/Users/dashik/Documents/dasha/Python/Maschine-learning/Geek_brains/book_info.pkl')

In [173]:
book_info_2 = pd.read_pickle('/Users/dashik/Documents/dasha/Python/Maschine-learning/Geek_brains/book_info.pkl')

In [174]:
book_info_2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0